Hello ! 

Just a little adding to the problem, it happens too when you umount / dis-attach the volume. 
Or even worth , no need of a VM. 

terraform version : 1.11

### With a VM 

Sequence : 

1. create a VM with TF 
2. create  a volume and a volume link resource to see it in the VM 
3. format / mount / put test files in the VM 
4. umount the volume 
5. remove the outscale_volume_link resource (not the volume) 
6. At this point the VM doesnt see anymore the disk
7. try to change the size of the volume resource
8. Terraform plans to destroy the volume to create a new one .. 

### Even with no VM 
In fact you can just try just this : 

_resource "outscale_volume" "vol" {
    subregion_name = "cloudgouv-eu-west-1b"
    size           = 20
    volume_type    = "standard"
}_

- terraform apply -> OK 
- change the size : 

_resource "outscale_volume" "vol" {
    subregion_name = "cloudgouv-eu-west-1b"
    size           = **20**
    volume_type    = "standard" #it also fails with "gp2"
}_

```
  # outscale_volume.vol must be replaced
-/+ resource "outscale_volume" "vol" {
      ~ creation_date  = "2025-05-16T20:56:23.300Z" -> (known after apply)
      ~ id             = "vol-a3560964" -> (known after apply)
      ~ iops           = 150 -> (known after apply)
      ~ linked_volumes = [] -> (known after apply)
      + request_id     = (known after apply)
      ~ size           = 10 -> 20 # forces replacement
      + snapshot_id    = (known after apply)
      ~ state          = "available" -> (known after apply)
      ~ volume_id      = "vol-a3560964" -> (known after apply)
        # (2 unchanged attributes hidden)
    }
```

Thanks in advance. 

Nicolas 





